In [8]:
import numpy as np
import pandas as pd

In [9]:
data = {"Company":["GOOGLE","GOOGLE","META",'META','TESLA','TESLA'],
        'Person':['준원','수혁','종현','서영','재영','혜민'],
        'Sales':[200,120,340,124,243,350]}

In [12]:
df = pd.DataFrame(data)

In [13]:
df

  Company Person  Sales
0  GOOGLE     준원    200
1  GOOGLE     수혁    120
2    META     종현    340
3    META     서영    124
4   TESLA     재영    243
5   TESLA     혜민    350

Groupby라는 내장 매소드를 통해 “company”칼럼에 있는 내용을 기준으로 나머지 데이터들을 합쳐준다.

In [15]:
df.groupby('Company')

In [16]:
by_comp = df.groupby("Company")

In [18]:
by_comp.mean()

         Sales
Company
GOOGLE   160.0
META     232.0
TESLA    296.5

In [19]:
by_comp.std()

              Sales
Company
GOOGLE    56.568542
META     152.735065
TESLA     75.660426

In [21]:
by_comp.min()

        Person  Sales
Company
GOOGLE      수혁    120
META        서영    124
TESLA       재영    243

In [22]:
by_comp.max()

        Person  Sales
Company
GOOGLE      준원    200
META        종현    340
TESLA       혜민    350

In [23]:
by_comp.count()

         Person  Sales
Company
GOOGLE        2      2
META          2      2
TESLA         2      2

In [24]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
META      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0
TESLA     2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0

In [25]:
by_comp.describe().transpose()
# transpose 매소드는 위 내용의 행과 열을 바꿔서 볼 수 있도록 해줌

Company          GOOGLE        META       TESLA
Sales count    2.000000    2.000000    2.000000
      mean   160.000000  232.000000  296.500000
      std     56.568542  152.735065   75.660426
      min    120.000000  124.000000  243.000000
      25%    140.000000  178.000000  269.750000
      50%    160.000000  232.000000  296.500000
      75%    180.000000  286.000000  323.250000
      max    200.000000  340.000000  350.000000

In [33]:
df.groupby('Company').describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64